/*
4.	Напишіть програму, яка створює витік пам'яті.
Збільшіть швидкість витоку пам'яті за допомогою створення об'єктів більшого розміру.
Поясніть як виправити програму.
*/

#include<iostream>
#include<Windows.h>

using namespace std;

int main() {
	int i = 1;
	double* ptr = 0;

	while (i)
	{
		//delete ptr;
		ptr = new double(1);
		cout << *ptr << endl;
	}

	system("pause");
	return 0;
}

/*
Щоб уникнути витоку памяті потрібно не переприсвоювати вказівник а спочатку його очистити і лише потім надати значення
*/